<?php

return [
    'admin_email' => 'admin@new-ishop.loc',
    'site_name' => 'E-Shop',
    'pagination' => 2,
];



/*
 * Данный код представляет собой содержимое файла params.php, который возвращает ассоциативный массив с некоторыми параметрами для конфигурации приложения. В этом файле определены следующие параметры:

'admin_email' => 'admin@new-ishop.loc': Это параметр admin_email, который устанавливает адрес электронной почты администратора сайта на admin@new-ishop.loc.

'site_name' => 'E-shop': Это параметр site_name, который устанавливает название сайта на E-shop.

'pagination' => 2: Это параметр pagination, который устанавливает количество элементов, отображаемых на одной странице при пагинации, равным 2.

Эти параметры предполагается использовать в различных частях приложения для настройки его поведения. Например, можно использовать 'admin_email' для отправки уведомлений администратору, 'site_name' для отображения названия сайта на разных страницах, и 'pagination' для определения количества элементов, выводимых на страницу при отображении данных из базы данных.
 */